FLAネットワーク協会 食生活アドバイザー検定事務局です。
お申込ありがとうございました。

郵送にて順次、専用の払込取扱票等一式をお送りします。

今回のお申込みは第55回食生活アドバイザー検定試験に関するお申込みです。

下記お申込内容となります。

なお本メールは自動返信メール専用となっており、返信はできません。

---------------------------------------------------------------------------
[ご質問]
過去に食生活アドバイザーの専用の払込取扱票請求をしたことがありますか？
{{ $answer1 }}

過去に食生活アドバイザーの受験をしたことがありますか？
{{ $answer2 }}

[氏名]
{{ $sei }} {{ $mei }}

[フリガナ]
{{ $sei_kana }} {{ $mei_kana }}

[生年月日]
{{ $birthday_year }}年 {{ $birthday_month }}月 {{ $birthday_day }}日

[性別]
{{ $gender }}

[住所]
〒 {{ $zip1 }}-{{ $zip2 }}
{{ $pref }}
{{ $city ?? '' }}
{{ $address1 }}
{{ $address2 }}
{{ $workplace }}
{{ $department }}

[電話番号]
{{ $tel }}

[メールアドレス]
{{ $mailaddress }}
---------------------------------------------------------------------------