<?php

return [

    // クレジットカード
    'credit_card' => [
        'month' => array_combine(range(1, 12), range(1, 12)),
        'year'  => array_combine(range(now()->format('y'), now()->format('y') + 15), range(now()->format('y'), now()->format('y') + 15)),
    ],

    // SB Payment Service
    'sbps' => [
        'merchant_id'      => env('SBPS_MERCHANT_ID'),
        'service_id'       => env('SBPS_SERVICE_ID'),
        'system_token_url' => env('SBPS_SYSTEM_TOKEN_URL'),
    ],

    // 申込データのステータス
    'status' => [
        '申込確定'   => 0,
        '入金待ち'   => 1,
        '要確認'     => 2,
        '決済処理中' => 3,
        'キャンセル' => 9,
    ],

    // 公開 / 非公開
    'public' => [
        '公開'   => 1,
        '非公開' => 0,
    ],

    // 都市
    'city' => [
        '東京' => 1,
        '福岡' => 2,
        '仙台' => 3,
        '大阪' => 4,
        '名古屋' => 5,
    ],

    // ご質問の回答
    'answer' => [
        'はい' => 1,
        'いいえ' => 0,
    ],

    //食生活アドバイザー会員
    'member' => [
        '食生活アドバイザー会員' => 1,
        '非会員' => 0,
    ],

    // 生年月日
    'birthday' => [
//        'year'  => array_combine(range(1908, now()->format('Y')), range(1908, now()->format('Y'))),
        'year'  => array_combine(range(now()->format('Y'), 1908), range(now()->format('Y'), 1908)),
        'month' => array_combine(range(1, 12), range(1, 12)),
        'day' => array_combine(range(1, 31), range(1, 31)),
    ],
    
    // 性別
    'gender' => [
        '男性' => 1,
        '女性' => 2,
        '回答なし' => 0,
    ],

    // 職業
    'job' => [
        '食品関係会社員(01)' => 1,
        'その他会社員(02)'   => 2,
        '医療関係会社員(03)' => 3,
        '福祉関係会社員(04)' => 4,
        '栄養士(05)'         => 5,
        '調理師(06)'         => 6,
        '教職(07)'           => 7,
        '主婦(08)'           => 8,
        '大学生(09)'         => 9,
        '短大生(10)'         => 10,
        '専門学校生(11)'     => 11,
        '高校生(12)'         => 12,
        '中学生(14)'         => 14,
        '大学院生(15)'       => 15,
        '公務員(16)'         => 16,
        'アルバイト(17)'     => 17,
        'その他(13)'         => 13,
    ],

    // 通学コース
    'normal' => [
        '2級講座' => 1,
    ],

    // 速習コース
    'fast' => [
        '合格講座' => 1,
    ],

    'pref' => [
        1  => '北海道',
        2  => '青森県',
        3  => '岩手県',
        4  => '宮城県',
        5  => '秋田県',
        6  => '山形県',
        7  => '福島県',
        8  => '茨城県',
        9  => '栃木県',
        10 => '群馬県',
        11 => '埼玉県',
        12 => '千葉県',
        13 => '東京都',
        14 => '神奈川県',
        15 => '新潟県',
        16 => '富山県',
        17 => '石川県',
        18 => '福井県',
        19 => '山梨県',
        20 => '長野県',
        21 => '岐阜県',
        22 => '静岡県',
        23 => '愛知県',
        24 => '三重県',
        25 => '滋賀県',
        26 => '京都府',
        27 => '大阪府',
        28 => '兵庫県',
        29 => '奈良県',
        30 => '和歌山県',
        31 => '鳥取県',
        32 => '島根県',
        33 => '岡山県',
        34 => '広島県',
        35 => '山口県',
        36 => '徳島県',
        37 => '香川県',
        38 => '愛媛県',
        39 => '高知県',
        40 => '福岡県',
        41 => '佐賀県',
        42 => '長崎県',
        43 => '熊本県',
        44 => '大分県',
        45 => '宮崎県',
        46 => '鹿児島県',
        47 => '沖縄県',
    ],
];
